faza5/app/Controllers/Guest.php

SELECT *
FROM `user`
WHERE `username` = 'ecy'
 LIMIT 1
---
    public function loginSubmit() {
        if (!$this->validate(['username' => 'required', 'password' => 'required']))
            return $this->show('login', ['errors' => $this->validator->getErrors()]);

        $userModel = new UserM();
        $user = $userModel->where('username', $this->request->getVar('username'))->first();

INSERT INTO `user` (`username`, `password`, `admin_rights`, `balance`, `review_ban`, `nickname`) VALUES ('lu190691d', 'qwaw', 0, 0, 0, 'lu190691d')
---
    public function registrationSubmit() {
        if (!$this->validate(['username' => 'required', 'password' => 'required']))
            return $this->show('registration', ['errors' => $this->validator->getErrors()]);

        $userM = new UserM();
        $userM->save([
            'username' => $this->request->getVar('username'),
            'password' => $this->request->getVar('password'),
            'admin_rights' => false,
            'balance' => 0,
            'review_ban' => false,
            'nickname' => $this->request->getVar('username')
        ]);